publish/html/dom基础.html
<?xml version="1.0" encoding="gb2312"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>dom基础</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb2312"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-21 18:04:15 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>
<div id="content">

<h1 class="title">dom基础</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 dom简介 </a>
<ul>
<li><a href="#sec-1_1">1.1 xml介绍 </a>
<ul>
<li><a href="#sec-1_1_1">1.1.1 基于SGML语言发展而来 </a></li>
<li><a href="#sec-1_1_2">1.1.2 针对xml的API </a></li>
<li><a href="#sec-1_1_3">1.1.3 特定语言的DOM </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 对DOM的支持 </a></li>
<li><a href="#sec-3">3 使用dom </a>
<ul>
<li><a href="#sec-3_1">3.1 节点的访问 </a>
<ul>
<li><a href="#sec-3_1_1">3.1.1 常用属性 </a></li>
</ul>
</li>
<li><a href="#sec-3_2">3.2 检测节点类型 </a></li>
<li><a href="#sec-3_3">3.3 处理特性 </a></li>
<li><a href="#sec-3_4">3.4 访问指定节点 </a>
<ul>
<li><a href="#sec-3_4_1">3.4.1 getElementByTagName() </a></li>
<li><a href="#sec-3_4_2">3.4.2 getElementById() </a></li>
<li><a href="#sec-3_4_3">3.4.3 getElementByName() </a></li>
</ul>
</li>
<li><a href="#sec-3_5">3.5 创建和操作节点 </a>
<ul>
<li><a href="#sec-3_5_1">3.5.1 创建节点 </a></li>
<li><a href="#sec-3_5_2">3.5.2 createElement/createTextNode/appendChild </a></li>
<li><a href="#sec-3_5_3">3.5.3 removeChild()/eaplaceChild()/insertBefore() </a></li>
<li><a href="#sec-3_5_4">3.5.4 createDocumentFragMent() </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 dom特征功能 </a>
<ul>
<li><a href="#sec-4_1">4.1 特性与属性 </a></li>
<li><a href="#sec-4_2">4.2 table方法 </a>
<ul>
<li><a href="#sec-4_2_1">4.2.1 table元素 </a></li>
<li><a href="#sec-4_2_2">4.2.2 tbody元素 </a></li>
<li><a href="#sec-4_2_3">4.2.3 tr元素 </a></li>
<li><a href="#sec-4_2_4">4.2.4 dom的遍历 </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> dom简介 </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> xml介绍 </h3>
<div class="outline-text-3" id="text-1_1">


</div>

<div id="outline-container-1_1_1" class="outline-4">
<h4 id="sec-1_1_1"><span class="section-number-4">1.1.1</span> 基于SGML语言发展而来 </h4>
<div class="outline-text-4" id="text-1_1_1">

</div>

</div>

<div id="outline-container-1_1_2" class="outline-4">
<h4 id="sec-1_1_2"><span class="section-number-4">1.1.2</span> 针对xml的API </h4>
<div class="outline-text-4" id="text-1_1_2">

<ul>
<li id="sec-1_1_2_1">sax <br/>
<ul>
<li id="sec-1_1_2_1_1">优点 <br/>
<ul>
<li>按文本方式解析,更清凉,快速
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_1_2">缺点 <br/>
<ul>
<li>解析中无法停止,无法直接访问结构中特定部分
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_2">dom <br/>
<ul>
<li>基于树实现
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3">节点的层次 <br/>
<ul>
<li>节点
<ul>
<li>定义了Node接口及节点类型来表示xml节点
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_1">Document <br/>
<ul>
<li>最顶层的节点,所有节点的根节点
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_2">DocumentType <br/>
<ul>
<li>DTD引用
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_3">DocumentFragment <br/>
<ul>
<li>可以和Document一样来保存其他节点
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_4">Elemtn <br/>
<ul>
<li>标签之间的内容
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_5">Attr <br/>
<ul>
<li>包含特性名和特性值的节点
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_6">Text <br/>
<ul>
<li>标签之间的文本内容
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_7">CDataSection <br/>
<ul>
<li>cdata对象表现
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_8">Entity <br/>
<ul>
<li>DTD中的一个实体定义
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_9">EntityReference <br/>
<ul>
<li>实体引用
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_10">ProcessingInstruction <br/>
<ul>
<li>代表一个pi
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_11">Comment <br/>
<ul>
<li>xml注释
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_3_12">Notation <br/>
<ul>
<li>DTD定义的记号
</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4">dom接口 <br/>
<ul>
<li id="sec-1_1_2_4_1">nodeName <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_2">nodeValue <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_3">NodeType <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_4">ownerDocument <br/>
<ul>
<li>节点所属的文档
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_5">firstChild <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_6">lastChild <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_7">previousSibling <br/>
<ul>
<li>指向前一个兄弟节点 
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_8">nextSibling <br/>
<ul>
<li>后一个兄弟节点
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_9">hasChildNodes() <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_10">attribute <br/>
<ul>
<li>代表一个元素特性的对象
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_11">appendChild(node) <br/>
<ul>
<li>末位添加node
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_12">removeChild(node) <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_13">replaceChild(newnode,oldnode) <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_14">insertBefore(newnode,refnode) <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_15">NodeList <br/>
<ul>
<li>节点数组
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1_1_2_4_16">NamedNodeMap <br/>
<ul>
<li>数值和名字进行索引的节点表
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1_1_3" class="outline-4">
<h4 id="sec-1_1_3"><span class="section-number-4">1.1.3</span> 特定语言的DOM </h4>
<div class="outline-text-4" id="text-1_1_3">

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 对DOM的支持 </h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 使用dom </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> 节点的访问 </h3>
<div class="outline-text-3" id="text-3_1">


</div>

<div id="outline-container-3_1_1" class="outline-4">
<h4 id="sec-3_1_1"><span class="section-number-4">3.1.1</span> 常用属性 </h4>
<div class="outline-text-4" id="text-3_1_1">

<ul>
<li>firstChild
</li>
<li>lastChild
</li>
<li>childNodes[i]
</li>
<li>item[i]
</li>
<li>例子



<pre class="src src-javaScript"> var oHtml = document.documentElement;
 var oHead = oHtml.firstChild;
 var oBody = oHtml.lastChild;
 // &#25110;&#32773;
 var oHead = oHtml.childNodes[0];
 var oBody = oHtml.childNodes[1];
//&#25110;&#32773;
 var oHead = oHtml.childNodes.item(0);
 var oBody = oHtml.childNodes.item(1);
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> 检测节点类型 </h3>
<div class="outline-text-3" id="text-3_2">

<ol>
<li>Document.noteType
</li>
<li>ie不支持节点类型常量,但可自定义
</li>
</ol>
</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> 处理特性 </h3>
<div class="outline-text-3" id="text-3_3">

<ol>
<li>Elemtnt节点的attributes属性就是NamedNodeMap
</li>
<li>常用方法
<ul>
<li>getNamedItem(name)
<ul>
<li>返回nodeName属性值等于name的节点
</li>
</ul>
</li>
<li>removeNamedItem(name)
<ul>
<li>删除nodeName属性值等于name的节点
</li>
</ul>
</li>
<li>setNamedItem(node)
<ul>
<li>将节点node添加到列表中
</li>
</ul>
</li>
<li>item(pos)
<ul>
<li>返回pos位置的节点
</li>
</ul>
</li>
<li>例子



<pre class="src src-javaScript"> op = Document.getElementById(<span style="color: #ffa07a;">"idName"</span>);
op.attrubutes.getNamedItem(<span style="color: #ffa07a;">"name"</span>).nodeValue= <span style="color: #ffa07a;">"&#35201;&#35774;&#32622;&#30340;&#23646;&#24615;&#20540;"</span>;
</pre>


</li>
</ul>
</li>
<li>属性操作的常用方法
</li>
<li>getAttrubite(name);
</li>
<li>setAttribute(name,value);
</li>
<li>removeAttribute(name);
</li>
</ol>
</div>

</div>

<div id="outline-container-3_4" class="outline-3">
<h3 id="sec-3_4"><span class="section-number-3">3.4</span> 访问指定节点 </h3>
<div class="outline-text-3" id="text-3_4">


</div>

<div id="outline-container-3_4_1" class="outline-4">
<h4 id="sec-3_4_1"><span class="section-number-4">3.4.1</span> getElementByTagName() </h4>
<div class="outline-text-4" id="text-3_4_1">

<ul>
<li>查询所有元素时,将参数设置为*
</li>
</ul>
</div>

</div>

<div id="outline-container-3_4_2" class="outline-4">
<h4 id="sec-3_4_2"><span class="section-number-4">3.4.2</span> getElementById() </h4>
<div class="outline-text-4" id="text-3_4_2">

</div>

</div>

<div id="outline-container-3_4_3" class="outline-4">
<h4 id="sec-3_4_3"><span class="section-number-4">3.4.3</span> getElementByName() </h4>
<div class="outline-text-4" id="text-3_4_3">

</div>
</div>

</div>

<div id="outline-container-3_5" class="outline-3">
<h3 id="sec-3_5"><span class="section-number-3">3.5</span> 创建和操作节点 </h3>
<div class="outline-text-3" id="text-3_5">


</div>

<div id="outline-container-3_5_1" class="outline-4">
<h4 id="sec-3_5_1"><span class="section-number-4">3.5.1</span> 创建节点 </h4>
<div class="outline-text-4" id="text-3_5_1">

<ul>
<li>不同浏览器支持不同
</li>
<li>常用方法
<ol>
<li>createDocumentFragMent()
<ul>
<li>创建一个文档碎片,封装多个节点一起提交
</li>
</ul>
</li>
<li>createElement()
</li>
<li>createTextNode()
</li>
</ol>
</li>
</ul>
</div>

</div>

<div id="outline-container-3_5_2" class="outline-4">
<h4 id="sec-3_5_2"><span class="section-number-4">3.5.2</span> createElement/createTextNode/appendChild </h4>
<div class="outline-text-4" id="text-3_5_2">

<ul>
<li>例子



<pre class="src src-javaScript"> var oP = document.createElement(<span style="color: #ffa07a;">"p"</span>);
 var oText = document.createTextNode(<span style="color: #ffa07a;">"hellow world!"</span>);
zoP.appendChild(oText);
document.body.appendChild(oP);
var oQ = document.doby.getElementByTagName(<span style="color: #ffa07a;">"p"</span>)[0];
document.body.removeChild(oQ);
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-3_5_3" class="outline-4">
<h4 id="sec-3_5_3"><span class="section-number-4">3.5.3</span> removeChild()/eaplaceChild()/insertBefore() </h4>
<div class="outline-text-4" id="text-3_5_3">




<pre class="src src-javaScript"> var oQ = document.doby.getElementByTagName(<span style="color: #ffa07a;">"p"</span>)[0];
document.body.removeChild(oQ);
</pre>


</div>

</div>

<div id="outline-container-3_5_4" class="outline-4">
<h4 id="sec-3_5_4"><span class="section-number-4">3.5.4</span> createDocumentFragMent() </h4>
<div class="outline-text-4" id="text-3_5_4">

<ul>
<li>创建一个文档碎片,一次性添加多个节点到document
</li>
<li>例子



<pre class="src src-javaScript">var arrText = [<span style="color: #ffa07a;">"first"</span>,<span style="color: #ffa07a;">"second"</span>,<span style="color: #ffa07a;">"third"</span>];
var oFragment = document.createDocumentFragMent();
for(var i=0;i&lt;arrText.length;i++){
 var oP = document.createElement(<span style="color: #ffa07a;">"p"</span>);
 var oText = document.createText(arrText[i]);
 oP.appendChild(oText);
 oFragment.appendChild(oP);
}
 document.body.appendChild(oFragment);
</pre>


</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> dom特征功能 </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> 特性与属性 </h3>
<div class="outline-text-3" id="text-4_1">

<ul>
<li>dom元素中包含的特效可作为属性
</li>
<li>例子



<pre class="src src-javaScript">&lt;image src=<span style="color: #ffa07a;">"test.jpg"</span> border=<span style="color: #ffa07a;">"0"</span>&gt;
oImage.setAttribute(<span style="color: #ffa07a;">"border"</span>,<span style="color: #ffa07a;">"2"</span>);

 oImage.src=<span style="color: #ffa07a;">"test2.jpg"</span>;
 oImage.border= <span style="color: #ffa07a;">"2"</span>;
</pre>


</li>
<li>注意
<ul>
<li>如果属性是class,则对应的属性名称是className
</li>
<li>尽可能第使用属性(ie兼容性差)
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> table方法 </h3>
<div class="outline-text-3" id="text-4_2">


</div>

<div id="outline-container-4_2_1" class="outline-4">
<h4 id="sec-4_2_1"><span class="section-number-4">4.2.1</span> table元素 </h4>
<div class="outline-text-4" id="text-4_2_1">

<ul>
<li>常用的特性
<ol>
<li>caption - &lt;caption&gt;
</li>
<li>tBodies - &lt;tbody&gt;
</li>
<li>tFoot - &lt;tfoot&gt;
</li>
<li>tHead - &lt;thead&gt;
</li>
<li>rows - 所有行集合
</li>
</ol>
</li>
<li>常见方法
<ol>
<li>createTHead() - 创建&lt;thead&gt;
</li>
<li>createTFoot() - 创建&lt;tfoot&gt;
</li>
<li>createCaption() - 创建&lt;caption&gt;
</li>
<li>deleteTHead()
</li>
<li>deleteTFoot()
</li>
<li>deleteCaption()
</li>
<li>deleteRow(position) - 删除指定行
</li>
<li>insertRow(postion) - 指定位置添加行
</li>
</ol>
</li>
</ul>
</div>

</div>

<div id="outline-container-4_2_2" class="outline-4">
<h4 id="sec-4_2_2"><span class="section-number-4">4.2.2</span> tbody元素 </h4>
<div class="outline-text-4" id="text-4_2_2">

<ul>
<li>常用特性
<ol>
<li>rows
</li>
</ol>
</li>
<li>常用方法
<ol>
<li>deleteRow(position)
</li>
<li>insertRow(position)
</li>
</ol>
</li>
</ul>
</div>

</div>

<div id="outline-container-4_2_3" class="outline-4">
<h4 id="sec-4_2_3"><span class="section-number-4">4.2.3</span> tr元素 </h4>
<div class="outline-text-4" id="text-4_2_3">

<ol>
<li>cells - 所有单元格的集合
</li>
<li>deleteCell(position) - 删除指定单元格
</li>
<li>insertCell(position) - 插入单元格
</li>
<li>例子



<pre class="src src-java"> window.onload = function (){
        <span style="color: #9acd32; font-weight: bold;">var</span> <span style="color: #7fffd4; font-weight: bold;">oTable</span> = document.createElement(<span style="color: #ffa07a;">"table"</span>);
        oTable.setAttribute(<span style="color: #ffa07a;">"border"</span>,<span style="color: #ffa07a;">"1"</span>);
        oTable.setAttribute(<span style="color: #ffa07a;">"width"</span>,<span style="color: #ffa07a;">"95%"</span>);
        
        <span style="color: #9acd32; font-weight: bold;">var</span> <span style="color: #7fffd4; font-weight: bold;">oTbody</span> = document.createElement(<span style="color: #ffa07a;">"tbody"</span>);
        oTable.appendChild(oTbody);
        
        oTbody.insertRow(0);
        oTbody.rows[0].insertCell(0);
        oTbody.rows[0].insertCell(1);
        oTbody.rows[0].cells[0].appendChild(document.createTextNode(<span style="color: #ffa07a;">"cell 1,1"</span>));
        oTbody.rows[0].cells[1].appendChild(document.createTextNode(<span style="color: #ffa07a;">"cell 2,1"</span>));
        document.body.appendChild(oTable);
}
</pre>


</li>
</ol>
</div>

</div>

<div id="outline-container-4_2_4" class="outline-4">
<h4 id="sec-4_2_4"><span class="section-number-4">4.2.4</span> dom的遍历 </h4>
<div class="outline-text-4" id="text-4_2_4">

<ul>
<li>NodeIterator
<ul>
<li>可对dom树进行深度优先的搜索
</li>
<li>4个参数
<ol>
<li>root
</li>
<li>whatToShow
</li>
<li>filter
</li>
<li>entityReferenceExpansion
</li>
</ol>
</li>
</ul>
</li>
<li>例子



<pre class="src src-html"> &lt;<span style="color: #7fffd4; font-weight: bold;">body</span>&gt;
    &lt;<span style="color: #7fffd4; font-weight: bold;">div</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"div1"</span>&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">p</span>&gt;hellow &lt;<span style="color: #7fffd4; font-weight: bold;">b</span>&gt;<span style="font-weight: bold;">world!</span>&lt;/<span style="color: #7fffd4; font-weight: bold;">b</span>&gt;&lt;/<span style="color: #7fffd4; font-weight: bold;">p</span>&gt;
      &lt;<span style="color: #7fffd4; font-weight: bold;">ul</span>&gt;
        &lt;<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;List item1&lt;/<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;
        &lt;<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;List item2&lt;/<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;
        &lt;<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;List item3&lt;/<span style="color: #7fffd4; font-weight: bold;">li</span>&gt;
      &lt;/<span style="color: #7fffd4; font-weight: bold;">ul</span>&gt;
    &lt;/<span style="color: #7fffd4; font-weight: bold;">div</span>&gt;
    &lt;<span style="color: #7fffd4; font-weight: bold;">textarea</span> <span style="color: #7fffd4; font-weight: bold;">rows</span>=<span style="color: #ffa07a;">"10"</span> <span style="color: #7fffd4; font-weight: bold;">cols</span>=<span style="color: #ffa07a;">"40"</span> <span style="color: #7fffd4; font-weight: bold;">id</span>=<span style="color: #ffa07a;">"text1"</span>&gt;&lt;/<span style="color: #7fffd4; font-weight: bold;">textarea</span>&gt;&lt;<span style="color: #7fffd4; font-weight: bold;">br</span>&gt;
    &lt;<span style="color: #7fffd4; font-weight: bold;">input</span> <span style="color: #7fffd4; font-weight: bold;">type</span>=<span style="color: #ffa07a;">"button"</span> <span style="color: #7fffd4; font-weight: bold;">value</span>=<span style="color: #ffa07a;">"&#25490;&#24207;"</span> <span style="color: #7fffd4; font-weight: bold;">onClick</span>=<span style="color: #ffa07a;">"makeList()"</span>&gt;
&lt;/<span style="color: #7fffd4; font-weight: bold;">body</span>&gt;
</pre>



<pre class="src src-javaScript">function makeList(){
       var oDiv = document.getElementById(<span style="color: #ffa07a;">"div1"</span>);
       iterator = document.createNodeIterator(oDiv,
       NodeFilter.SHOW_ELEMENT,null,false);
       
       var oOutput = document.getElementById(<span style="color: #ffa07a;">"text1"</span>);
       var oNode = iterator.nextNode();
       while(oNode){
               oOutput.value +=oNode.innerHTML +<span style="color: #ffa07a;">"\n"</span>;
               oNode = iterator.nextNode();
               }
       }
</pre>


</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author">Author: </p>
<p class="creator">Org version 7.5 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
